Newfile

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:crfpSP9="http://com/rbsg/soa/C040PaymentManagement/CustomerRetrievalForPayment/V01/ServiceParameters/V01/">
    <soapenv:Header/>
    <soapenv:Body>
        <crfpSP9:retrievePrimaryCustomerForArr>
            <requestHeader>
                <operatingBrand>NWB</operatingBrand>
                <requestIds>
                    <systemId>RequestID</systemId>
                    <transactionId>123454444</transactionId>
                </requestIds>
                <requestIds>
               <systemId>SourceID</systemId>
               <transactionId>ISO</transactionId>
        </requestIds>
            <cmdType>Request</cmdType>
            </requestHeader>
            <processingParameter>
            <objectReference>
               <identifier>NWB</identifier>
               <context>
                  <schemeName>OrganizationEnterpriseIdType</schemeName>
                  <codeValue>OperatingBrandIdentifier</codeValue>
               </context>
            </objectReference>
        </processingParameter>
            <arrangementIdentifier>
                <identifier>GB29NWBK60161331926801</identifier>
                <context>
                    <schemeName>ArrangementEnterpriseIdType</schemeName>
                    <codeValue>InternationalBankAccountNumber</codeValue>
                    <!--Optional:-->
                    <description>aslkjdslahbkjdf</description>
                </context>
                <!--Optional:-->
                <description>aslkjdslahbkjdf</description>
            </arrangementIdentifier>
        </crfpSP9:retrievePrimaryCustomerForArr>
    </soapenv:Body>
</soapenv:Envelope>
 
